app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("artist", "title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist", "21 savage"], ["title", "ric flair drop"], ["url", "www.21savage.com"], ["created_at", 2018-01-09 22:19:42 UTC], ["updated_at", 2018-01-09 22:19:42 UTC]]
---
  def create
    @picture = Picture.new
    @picture.title = params[:picture][:title]
    @picture.artist = params[:picture][:artist]
    @picture.url = params[:picture][:url]
    if @picture.save